// ============================================================================
// 
// ユーザーの公開情報（他人も取得可能な情報）
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;

namespace YukariBlazorDemo.Shared.Authorization
{
	public class PublicUserInfo
	{
		// ====================================================================
		// public プロパティー（他人も取得可能な情報）
		// ====================================================================

		// ID
		public String Id { get; set; } = String.Empty;

		// 管理者権限かどうか
		public Boolean IsAdmin { get; set; }

		// 名前
		public String Name { get; set; } = String.Empty;

		// ====================================================================
		// public プロパティー（管理者のみ取得可能な情報）
		// ====================================================================

		// 更新日時 UTC（修正ユリウス日）
		public Double LastModified { get; set; }

		// 前回ログイン日時 UTC（修正ユリウス日）
		public Double LastLogin { get; set; }
	}
}
