// ============================================================================
// 
// 曲情報のプロパティーを規定するインターフェース
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;

namespace YukariBlazorDemo.Shared.Database
{
	public interface ISongProperty
	{
		// ====================================================================
		// public プロパティー
		// ====================================================================

		// 曲名
		String SongName { get; set; }

		// タイアップ名
		String TieUpName { get; set; }

		// 歌手名
		String ArtistName { get; set; }

		// 制作会社
		String MakerName { get; set; }

		// 動画制作者
		String Worker { get; set; }

		// 動画ファイル名
		String Path { get; set; }
	}
}
