// ============================================================================
// 
// キャッシュの有効期限を設定する属性
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using Microsoft.AspNetCore.Mvc.Filters;

using System;

namespace YukariBlazorDemo.Server.Attributes
{
	[AttributeUsage(AttributeTargets.Class | AttributeTargets.Method)]
	public class CachePeriodAttribute : ActionFilterAttribute
	{
		// ====================================================================
		// コンストラクター・デストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター
		// --------------------------------------------------------------------
		public CachePeriodAttribute(Int32 period)
		{
			_period = period;
		}

		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// action result 実行前
		// OnResultExecuted() では既に応答が始まっているのでキャッシュコントロールを変更できない
		// --------------------------------------------------------------------
		public override void OnResultExecuting(ResultExecutingContext context)
		{
			// public: レスポンスをどのキャッシュにも格納することができる（shared キャッシュ（プロキシ等）も格納可能）
			// must-revalidate: リソースが古くなったら検証が必要（クライアントから If-None-Match ヘッダー付きでリクエストが送られてくる想定）
			// max-age: リソースが古くなるまでの時間 [秒]
			context.HttpContext.Response.Headers["Cache-Control"] = "public, must-revalidate, max-age=" + _period.ToString();
			base.OnResultExecuting(context);
		}

		// ====================================================================
		// private メンバー変数
		// ====================================================================

		// 有効期間 [s]
		private readonly Int32 _period;
	}
}
