// ============================================================================
// 
// クライアント側の雑多なクラス群
// 
// ============================================================================

// ----------------------------------------------------------------------------
//
// ----------------------------------------------------------------------------

using System;

namespace YukariBlazorDemo.Client.Models.Misc
{
	// ====================================================================
	// 疑似タブ描画用情報
	// ====================================================================
	public class TabItem
	{
		public TabItem(String label, String address)
		{
			Label = label;
			Address = address;
		}

		// 表示用ラベル
		public String Label { get; }

		// クリック時のリンク先
		public String Address { get; }
	}
}
