// ============================================================================
// 
// タスク拡張
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System.Diagnostics;
using System.Threading.Tasks;

namespace YukariBlazorDemo.Shared.Misc
{
	public static class TaskExtension
	{
		// ====================================================================
		// public static メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// タスクの終了を待たず、例外発生時はメッセージを出力
		// --------------------------------------------------------------------
		public static void NoWait(this Task task)
		{
			task.ContinueWith(x =>
			{
				Debug.WriteLine("非待機タスク実行時エラー：\n" + x.Exception?.Message);
				Debug.WriteLine("　スタックトレース：\n" + x.Exception?.StackTrace);
			}, TaskContinuationOptions.OnlyOnFaulted);
		}
	}
}
