// ============================================================================
// 
// ログイン情報
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;
using System.ComponentModel.DataAnnotations;

namespace YukariBlazorDemo.Shared
{
	public class LoginInfo
	{
		// ====================================================================
		// public プロパティー
		// ====================================================================

		// ID
		public Int32 Id { get; set; }

		// 名前
		[Required(ErrorMessage = "お名前を入力してください。")]
		public String Name { get; set; } = String.Empty;

		// パスワード
		[Required(ErrorMessage = "パスワードを入力してください。")]
		public String Password { get; set; } = String.Empty;

		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// 必須項目が格納されているか
		// --------------------------------------------------------------------
		public Boolean IsValid()
		{
			return !String.IsNullOrEmpty(Name) && !String.IsNullOrEmpty(Password);
		}

	}
}
