// ============================================================================
// 
// 名前とフリガナのペア
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;

namespace YukariBlazorDemo.Shared
{
	public record NameAndRuby
	{
		// ====================================================================
		// コンストラクター・デストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター（名前とフリガナをそれぞれ指定）
		// ルビは正規化される
		// --------------------------------------------------------------------
		public NameAndRuby(String name, String unnormalizedRuby)
		{
			Name = name;
			Ruby = YbdCommon.NormalizeRuby(unnormalizedRuby);
		}

		// --------------------------------------------------------------------
		// コンストラクター（名前がひらがな・カタカナのみのもの用）
		// --------------------------------------------------------------------
		public NameAndRuby(String unnormalizedRuby)
		{
			Name = unnormalizedRuby;
			Ruby = YbdCommon.NormalizeRuby(unnormalizedRuby);
		}

		// ====================================================================
		// public プロパティー
		// ====================================================================

		// 名前
		public String Name { get; }

		// フリガナ
		public String Ruby { get; }
	}
}
